Imports

In [1]:
import pandas as pd
import numpy as np

For this project I want to start with loading in a
dataframe that measures the total amount of 
pregnancies and the total amount of births in 
each state in the United States.

In [2]:
df = pd.read_csv('data_files/total_pregnancies.csv')
df.head(100)

,measure_name,datum,state_id,state_name,first_year,last_year,footnotes,sources
0,No. of pregnancies ending in birth,10445,AK,Alaska,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
1,No. of pregnancies ending in birth,58941,AL,Alabama,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
2,No. of pregnancies ending in birth,37520,AR,Arkansas,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
3,No. of pregnancies ending in birth,81872,AZ,Arizona,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
4,No. of pregnancies ending in birth,471658,CA,California,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
...,...,...,...,...,...,...,...,...
95,Total no. of pregnancies among women aged 15-44,8040,VT,Vermont,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
96,Total no. of pregnancies among women aged 15-44,124610,WA,Washington,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
97,Total no. of pregnancies among women aged 15-44,86260,WI,Wisconsin,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
98,Total no. of pregnancies among women aged 15-44,25030,WV,West Virginia,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
99,Total no. of pregnancies among women aged 15-44,9080,WY,Wyoming,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."

So there a couple problems with this Dataframe.
1. I want to change the name of column state_id to state_abrv
2. I want to delete the first_year, last_year, footnotes, and sources columns because they are not useful to the project.
3. The measure_name column identifies what our datum column is measuring. It also measures two different variables. I want the variables split into two dataframes.
4. I want to rename the datum column in each dataframe to "total_births" and "total_pregnancies".
5. I have to reset the index in df_change.
6. I want to drop the new "index" column it creates.
7. I want to extract the "total_pregnancies" column from the df_change and combine it with df_2017.
8. I want to delete the measure_name column from the dataframe.

In [3]:
# 1. Renaming the state_id column.
df.rename(columns={'state_id':'state_abrv'}, inplace=True)
df.head()

,measure_name,datum,state_abrv,state_name,first_year,last_year,footnotes,sources
0,No. of pregnancies ending in birth,10445,AK,Alaska,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
1,No. of pregnancies ending in birth,58941,AL,Alabama,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
2,No. of pregnancies ending in birth,37520,AR,Arkansas,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
3,No. of pregnancies ending in birth,81872,AZ,Arizona,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."
4,No. of pregnancies ending in birth,471658,CA,California,2017,NaN,NaN,"Maddow-Zimet I and Kost K, <i>Pregnancies, Bir..."

In [4]:
# 2. Deleting columns that are not useful.
df.drop(columns=['first_year', 'last_year', 'footnotes', 'sources'], inplace=True)
df.head()

                         measure_name   datum state_abrv  state_name
0  No. of pregnancies ending in birth   10445         AK      Alaska
1  No. of pregnancies ending in birth   58941         AL     Alabama
2  No. of pregnancies ending in birth   37520         AR    Arkansas
3  No. of pregnancies ending in birth   81872         AZ     Arizona
4  No. of pregnancies ending in birth  471658         CA  California

In [5]:
# 3. Creating two dataframes.
df_2017 = df.iloc[0:50,:].copy()
df_change = df.iloc[50:,:].copy()

In [6]:
df_2017.head()

                         measure_name   datum state_abrv  state_name
0  No. of pregnancies ending in birth   10445         AK      Alaska
1  No. of pregnancies ending in birth   58941         AL     Alabama
2  No. of pregnancies ending in birth   37520         AR    Arkansas
3  No. of pregnancies ending in birth   81872         AZ     Arizona
4  No. of pregnancies ending in birth  471658         CA  California

In [7]:
df_change.head()

,measure_name,datum,state_abrv,state_name
50,Total no. of pregnancies among women aged 15-44,14090,AK,Alaska
51,Total no. of pregnancies among women aged 15-44,79150,AL,Alabama
52,Total no. of pregnancies among women aged 15-44,49110,AR,Arkansas
53,Total no. of pregnancies among women aged 15-44,112840,AZ,Arizona
54,Total no. of pregnancies among women aged 15-44,710510,CA,California

In [8]:
# 4. Renaming "datum" in each dataframe to "total_births" and "total_pregnancies".
df_2017.rename(columns={'datum':'total_births'}, inplace=True)
df_change.rename(columns={'datum':'total_pregnancies'}, inplace=True)

In [9]:
df_2017.head()

                         measure_name  total_births state_abrv  state_name
0  No. of pregnancies ending in birth         10445         AK      Alaska
1  No. of pregnancies ending in birth         58941         AL     Alabama
2  No. of pregnancies ending in birth         37520         AR    Arkansas
3  No. of pregnancies ending in birth         81872         AZ     Arizona
4  No. of pregnancies ending in birth        471658         CA  California

In [10]:
df_change.head()

,measure_name,total_pregnancies,state_abrv,state_name
50,Total no. of pregnancies among women aged 15-44,14090,AK,Alaska
51,Total no. of pregnancies among women aged 15-44,79150,AL,Alabama
52,Total no. of pregnancies among women aged 15-44,49110,AR,Arkansas
53,Total no. of pregnancies among women aged 15-44,112840,AZ,Arizona
54,Total no. of pregnancies among women aged 15-44,710510,CA,California

In [11]:
# 5. Resetting index to 0:49 instead of 50:99 in a new dataframe.
df_col = df_change['total_pregnancies'].reset_index()
df_col.head()

   index  total_pregnancies
0     50              14090
1     51              79150
2     52              49110
3     53             112840
4     54             710510

In [12]:
# 6. Dropping the new index column
df_col.drop(columns='index', inplace=True)
df_col.head()

   total_pregnancies
0              14090
1              79150
2              49110
3             112840
4             710510

In [13]:
# 7. Adding the 'total_pregnancies' column to the first dataframe.
df_2017['total_pregnancies'] = df_col['total_pregnancies'].copy()
df_2017.head()

,measure_name,total_births,state_abrv,state_name,total_pregnancies
0,No. of pregnancies ending in birth,10445,AK,Alaska,14090
1,No. of pregnancies ending in birth,58941,AL,Alabama,79150
2,No. of pregnancies ending in birth,37520,AR,Arkansas,49110
3,No. of pregnancies ending in birth,81872,AZ,Arizona,112840
4,No. of pregnancies ending in birth,471658,CA,California,710510

In [14]:
# 8. Dropping the 'measure_name' column
df_2017.drop(columns='measure_name', inplace=True)
df_2017.head()

   total_births state_abrv  state_name  total_pregnancies
0         10445         AK      Alaska              14090
1         58941         AL     Alabama              79150
2         37520         AR    Arkansas              49110
3         81872         AZ     Arizona             112840
4        471658         CA  California             710510

Now I want to add in the total population of women in each state from a separate csv to the main dataframe.

In [15]:
# Reading in women_population.csv
df_pop = pd.read_csv('data_files/women_population.csv')
df_pop.head(100)

,measure_name,datum,state_id,state_name,first_year,last_year,footnotes,sources
0,Population of women aged 13-44,1014030,AL,Alabama,2016,NaN,NaN,Publicly Supported Family Planning Services in...
1,Population of women aged 13-44,155560,AK,Alaska,2016,NaN,NaN,Publicly Supported Family Planning Services in...
2,Population of women aged 13-44,1418140,AZ,Arizona,2016,NaN,NaN,Publicly Supported Family Planning Services in...
3,Population of women aged 13-44,614890,AR,Arkansas,2016,NaN,NaN,Publicly Supported Family Planning Services in...
4,Population of women aged 13-44,8557280,CA,California,2016,NaN,NaN,Publicly Supported Family Planning Services in...
...,...,...,...,...,...,...,...,...
95,Total no. of women aged 15-44,1681168,VA,Virginia,2017,NaN,NaN,"National Center for Health Statistics, Vintage..."
96,Total no. of women aged 15-44,1464754,WA,Washington,2017,NaN,NaN,"National Center for Health Statistics, Vintage..."
97,Total no. of women aged 15-44,322254,WV,West Virginia,2017,NaN,NaN,"National Center for Health Statistics, Vintage..."
98,Total no. of women aged 15-44,1083819,WI,Wisconsin,2017,NaN,NaN,"National Center for Health Statistics, Vintage..."
99,Total no. of women aged 15-44,107740,WY,Wyoming,2017,NaN,NaN,"National Center for Health Statistics, Vintage..."

There are a few problems with this dataframe. In order to fix this I will:
1. I want to change the name of column state_id to state_abrv
2. I want to delete the first_year, last_year, footnotes, and sources columns because they are not useful to the project.
3. The measure_name column identifies what our datum column is measuring. I am going to create a dataframe using the data labelled "Total no. of women aged 15-44" from 50:, because it is from 2017 like my previous dataframes.
4. I want to rename the datum column in the usable dataframe to "pop_women_aged_15-44".
5. I have to reset the index in df_usable. 
6. I want to drop the new "index" column it creates.
7. I want to extract the "pop_women_aged_15-44" column from the df_usable and combine it with df_2017.
8. I want the index of my dataframes to make the data easy to identify. The best solution is to make the state_abrv column the index.
9. I want to move my state_name column next to my state_abrv index for clarity in grouping.

In [16]:
# 1. Renaming state_id column to state_abrv
df_pop.rename(columns={'state_id':'state_abrv'}, inplace=True)
df_pop.head()

,measure_name,datum,state_abrv,state_name,first_year,last_year,footnotes,sources
0,Population of women aged 13-44,1014030,AL,Alabama,2016,NaN,NaN,Publicly Supported Family Planning Services in...
1,Population of women aged 13-44,155560,AK,Alaska,2016,NaN,NaN,Publicly Supported Family Planning Services in...
2,Population of women aged 13-44,1418140,AZ,Arizona,2016,NaN,NaN,Publicly Supported Family Planning Services in...
3,Population of women aged 13-44,614890,AR,Arkansas,2016,NaN,NaN,Publicly Supported Family Planning Services in...
4,Population of women aged 13-44,8557280,CA,California,2016,NaN,NaN,Publicly Supported Family Planning Services in...

In [17]:
# 2. Deleting columns that are not useful.
df_pop.drop(columns=['first_year', 'last_year', 'footnotes', 'sources'], inplace=True)
df_pop.head()

                     measure_name    datum state_abrv  state_name
0  Population of women aged 13-44  1014030         AL     Alabama
1  Population of women aged 13-44   155560         AK      Alaska
2  Population of women aged 13-44  1418140         AZ     Arizona
3  Population of women aged 13-44   614890         AR    Arkansas
4  Population of women aged 13-44  8557280         CA  California

In [18]:
# 3. Getting the needed dataframe
df_usable = df_pop.iloc[50:,:].copy()
df_usable.head()

                     measure_name    datum state_abrv  state_name
50  Total no. of women aged 15-44   949949         AL     Alabama
51  Total no. of women aged 15-44   146072         AK      Alaska
52  Total no. of women aged 15-44  1345764         AZ     Arizona
53  Total no. of women aged 15-44   577447         AR    Arkansas
54  Total no. of women aged 15-44  8104632         CA  California

In [19]:
# 4. Renaming the datum column
df_usable.rename(columns={'datum':'women_pop_15-44'}, inplace=True)
df_usable.head()

                     measure_name  women_pop_15-44 state_abrv  state_name
50  Total no. of women aged 15-44           949949         AL     Alabama
51  Total no. of women aged 15-44           146072         AK      Alaska
52  Total no. of women aged 15-44          1345764         AZ     Arizona
53  Total no. of women aged 15-44           577447         AR    Arkansas
54  Total no. of women aged 15-44          8104632         CA  California

At this point I realized this csv data is sorted by the state name. The previous csv is sorted by the state abbreviation. I need to sort this data by the state abbreviation before going further.

In [20]:
#   Sorting values by the state_abrv column
df_usable.sort_values(by='state_abrv', inplace=True)
df_usable.head()

                     measure_name  women_pop_15-44 state_abrv  state_name
51  Total no. of women aged 15-44           146072         AK      Alaska
50  Total no. of women aged 15-44           949949         AL     Alabama
53  Total no. of women aged 15-44           577447         AR    Arkansas
52  Total no. of women aged 15-44          1345764         AZ     Arizona
54  Total no. of women aged 15-44          8104632         CA  California

In [21]:
# 5. Resetting the index
df_col2 = df_usable['women_pop_15-44'].reset_index()
df_col2.head()

   index  women_pop_15-44
0     51           146072
1     50           949949
2     53           577447
3     52          1345764
4     54          8104632

In [22]:
# 6. Dropping the index column
df_col2.drop(columns='index', inplace=True)
df_col2.head()

   women_pop_15-44
0           146072
1           949949
2           577447
3          1345764
4          8104632

In [23]:
# 7. Adding the column to df_2017.
df_2017['women_pop_15-44'] = df_col2['women_pop_15-44'].copy()
df_2017.head()

   total_births state_abrv  state_name  total_pregnancies  women_pop_15-44
0         10445         AK      Alaska              14090           146072
1         58941         AL     Alabama              79150           949949
2         37520         AR    Arkansas              49110           577447
3         81872         AZ     Arizona             112840          1345764
4        471658         CA  California             710510          8104632

In [24]:
# 8. Setting index to state abreviations.
df_2017.set_index(['state_abrv'], inplace=True)
df_2017.head()

            total_births  state_name  total_pregnancies  women_pop_15-44
state_abrv
AK                 10445      Alaska              14090           146072
AL                 58941     Alabama              79150           949949
AR                 37520    Arkansas              49110           577447
AZ                 81872     Arizona             112840          1345764
CA                471658  California             710510          8104632

In [25]:
# 9. Moving columns.
df_2017 = df_2017[['state_name', 'total_pregnancies', 'total_births', 'women_pop_15-44']]
df_2017.head(50)

                state_name  total_pregnancies  total_births  women_pop_15-44
state_abrv
AK                  Alaska              14090         10445           146072
AL                 Alabama              79150         58941           949949
AR                Arkansas              49110         37520           577447
AZ                 Arizona             112840         81872          1345764
CA              California             710510        471658          8104632
CO                Colorado              89470         64382          1137745
CT             Connecticut              55410         35221           672949
DE                Delaware              16070         10855           180343
FL                 Florida             343850        223630          3828199
GA                 Georgia             190870        129243          2147399
HI                  Hawaii              24560         17517           265924
IA                    Iowa              50130         38430           592278
ID                   Idaho              28580         22181           328941
IL                Illinois             220810        149390          2532027
IN                 Indiana             109910         82170          1295622
KS                  Kansas              47700         36519           558606
KY                Kentucky              70960         54752           848472
LA               Louisiana              83430         61018           936106
MA           Massachusetts             105610         70702          1381812
MD                Maryland             115600         71641          1193286
ME                   Maine              17010         12298           231535
MI                Michigan             162450        111426          1874298
MN               Minnesota              93430         68595          1066806
MO                Missouri              98310         73034          1171775
MS             Mississippi              50250         37357           591744
MT                 Montana              15820         11799           190089
NC          North Carolina             171720        120125          2016657
ND            North Dakota              13950         10737           146282
NE                Nebraska              33460         25821           370172
NH           New Hampshire              17110         12116           241346
NJ              New Jersey             173210        101250          1715123
NM              New Mexico              32730         23767           395286
NV                  Nevada              53490         35756           589149
NY                New York             389050        229737          4001053
OH                    Ohio             186820        136832          2203285
OK                Oklahoma              65520         50214           768751
OR                  Oregon              62200         43631           810399
PA            Pennsylvania             202590        137745          2383721
RI            Rhode Island              16380         10638           209072
SC          South Carolina              80960         57029           965704
SD            South Dakota              15380         12134           158874
TN               Tennessee             109390         81016          1312517
TX                   Texas             520440        382050          5885855
UT                    Utah              61620         48585           675124
VA                Virginia             142780        100391          1681168
VT                 Vermont               8040          5655           113854
WA              Washington             124610         87562          1464754
WI               Wisconsin              86260         64975          1083819
WV           West Virginia              25030         18675           322254
WY                 Wyoming               9080          6903           107740

I've got the complete dataframe I want. Now I need to analyze the data.